jelson/rulos/src/lib/chip/arm/stm32/periph/uart/uart.c
void USART3_4_5_6_LPUART1_IRQHandler() {
  on_usart_interrupt(2);
  on_usart_interrupt(3);
  on_usart_interrupt(4);
  on_usart_interrupt(5);
}

#else
void USART2_IRQHandler() {
  on_usart_interrupt(1);
}

#define DMA1_Channel4_IRQn DMA1_Ch4_5_DMAMUX1_OVR_IRQn
#define DMA1_Channel5_IRQn DMA1_Ch4_5_DMAMUX1_OVR_IRQn

void DMA1_Ch4_5_DMAMUX1_OVR_IRQHandler() {
  on_rx_dma_interrupt(1);  // DMA 1:4
  dispatch_tx_dma(0);      // DMA 1:5
}
#endif

static const stm32_uart_config_t stm32_uart_config[] = {
    {
      // rulos uart 0
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

#ifdef USART1_RXTX_ON_B7B6
        .rx_port = GPIOB,
        .rx_pin = GPIO_PIN_7,
#else
        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_10,
#endif
        //. comment out line below to test interrupt mode
        .rx_dma_instance = DMA1,
        .rx_dma_channel = LL_DMA_CHANNEL_1,
        .rx_dma_irqn = DMA1_Channel1_IRQn,
        .rx_dma_request = DMA_REQUEST_USART1_RX,

#ifdef USART1_RXTX_ON_B7B6
        .tx_port = GPIOB,
        .tx_pin = GPIO_PIN_6,
#else
        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_9,
#endif
        .tx_dma_chan = DMA1_Channel5,
        .tx_dma_irqn = DMA1_Channel5_IRQn,
        .tx_dma_request = DMA_REQUEST_USART1_TX,
#ifdef USART1_RXTX_ON_B7B6
        .altfunc = GPIO_AF0_USART1,
#else
        .altfunc = GPIO_AF1_USART1,
#endif
    },
    {
      // rulos uart 1
        .instance = USART2,
        .instance_irqn = USART2_IRQn,
        .rx_port = GPIOA,
#ifdef USART2_RX_ON_A15
        .rx_pin = GPIO_PIN_15,
#else
        .rx_pin = GPIO_PIN_3,
#endif
        .rx_dma_instance = DMA1,
        .rx_dma_channel = LL_DMA_CHANNEL_4,
        .rx_dma_irqn = DMA1_Channel4_IRQn,
        .rx_dma_request = DMA_REQUEST_USART2_RX,

#ifndef temp_disabled_UART_SURRENDER_DMA1_CHAN2_3
        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_2,
        .tx_dma_chan = DMA1_Channel2,
        .tx_dma_irqn = DMA1_Channel2_3_IRQn,
        .tx_dma_request = DMA_REQUEST_USART2_TX,
        .altfunc = GPIO_AF1_USART2,
#endif
    },
#ifdef USART3
    {
      // rulos uart 2
        .instance = USART3,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_port = GPIOB,
        .rx_pin = GPIO_PIN_9,
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_1,
        .rx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .rx_dma_request = DMA_REQUEST_USART3_RX,

#ifndef UART_SURRENDER_DMA1_CHAN2_3
        .tx_port = GPIOB,
        .tx_pin = GPIO_PIN_2,
        .tx_dma_chan = DMA1_Channel3,
        .tx_dma_irqn = DMA1_Channel2_3_IRQn,
        .tx_dma_request = DMA_REQUEST_USART3_TX,
        .altfunc = GPIO_AF4_USART3,
#endif
    },
#endif
#ifdef USART4
    {
      // rulos uart 3
        .instance = USART4,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_1,
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_2,
        .rx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .rx_dma_request = DMA_REQUEST_USART4_RX,

        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_0,
        .tx_dma_chan = DMA1_Channel6,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART4_TX,
        .altfunc = GPIO_AF4_USART4,
    },
#endif
#ifdef USART5
    {
      // rulos uart 4
        .instance = USART5,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_port = GPIOB,
#ifdef USART5_RX_ON_B4
        .rx_pin = GPIO_PIN_4,
        .altfunc = GPIO_AF3_USART5,
#else
        .rx_pin = GPIO_PIN_1,
        .altfunc = GPIO_AF8_USART5,
#endif
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_3,
        .rx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .rx_dma_request = DMA_REQUEST_USART5_RX,

        .tx_port = GPIOB,
        .tx_pin = GPIO_PIN_0,
        .tx_dma_chan = DMA1_Channel7,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART5_TX,
    },
#endif
#ifdef USART6
    {
        .instance = USART6,
        .instance_irqn = USART3_4_5_6_LPUART1_IRQn,
        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_5,
        .rx_dma_instance = DMA2,
        .rx_dma_channel = LL_DMA_CHANNEL_4,
        .rx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .rx_dma_request = DMA_REQUEST_USART6_RX,
        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_4,
        .tx_dma_chan = DMA2_Channel5,
        .tx_dma_irqn = DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQn,
        .tx_dma_request = DMA_REQUEST_USART6_TX,
        .altfunc = GPIO_AF3_USART6,
    },
#endif
};

///////////// stm32g4

#elif defined(RULOS_ARM_stm32g4)

void USART1_IRQHandler() {
  on_usart_interrupt(0);
}

void DMA1_Channel1_IRQHandler() {
  dispatch_tx_dma(0);
}

void DMA1_Channel2_IRQHandler() {
  on_rx_dma_interrupt(0);
}

static const stm32_uart_config_t stm32_uart_config[] = {
    {
        .instance = USART1,
        .instance_irqn = USART1_IRQn,

        .rx_port = GPIOA,
        .rx_pin = GPIO_PIN_10,
        .rx_dma_channel = LL_DMA_CHANNEL_2,
        .rx_dma_irqn = DMA1_Channel2_IRQn,
        .rx_dma_request = DMA_REQUEST_USART1_RX,

        .tx_port = GPIOA,
        .tx_pin = GPIO_PIN_9,
        .tx_dma_chan = DMA1_Channel1,
        .tx_dma_irqn = DMA1_Channel1_IRQn,
        .tx_dma_request = DMA_REQUEST_USART1_TX,
        .altfunc = GPIO_AF7_USART1,
    },
};

/////////////////////////////////////////

#else
#error "Tell the UART code about your chip's UART."
#include <stophere>
#endif

// Eventually this should be conditional depending on what kind of
// chip you have
#define NUM_UARTS (sizeof(stm32_uart_config) / sizeof(stm32_uart_config[0]))
static stm32_uart_t g_stm32_uarts[NUM_UARTS] = {};

#ifdef USE_RX_DMA_FOR_CHIP
#define USART_USING_RX_DMA(config) ((config)->rx_dma_instance != NULL)
#else
#define USART_USING_RX_DMA(config) (false)
#endif

///////////////////// reception /////////////////////////////

static void on_rx_buffer_full(uint8_t uart_id, stm32_uart_t *u,
                              const stm32_uart_config_t *c);

//// Receiving: DMA Version

